{"blacklisted_ids": [{"id": "1mgu52u", "title": "AITA for saying it's inappropriate that my brother’s girlfriend keeps wearing my clothes?", "timestamp": 1754427514.7712674}, {"id": "1mfcaue", "title": "AITA for taking walks on my lunch break?", "timestamp": 1754428044.0414715}, {"id": "1mfh8g1", "title": "AITA for not bonding with my in-laws because they are fighting bunch of people?", "timestamp": 1754472872.634475}, {"id": "eh8f8j", "title": "AITA: I, a female, want to give my fiance my last name, but my father and brother don't want me to. Am I wrong for planning on doing it anyways?", "timestamp": 1754473337.2515225}, {"id": "devz7y", "title": "AITA for going to the police over a 'prank'", "timestamp": 1754473431.629696}, {"id": "gcr7vr", "title": "AITA For Not Baking Much For My Family", "timestamp": 1754473494.4129024}, {"id": "m3iae3", "title": "AITA UPDATE: AITA for telling my daughter it's her fault she has no pictures of herself?", "timestamp": 1754503018.4843044}, {"id": "hv5qaz", "title": "AITA for telling a guy with autism off because he wouldn’t stop talking about something he knows nothing about?", "timestamp": 1754503059.0096996}, {"id": "ei9igg", "title": "AITA for laughing uncontrollably at my son when he asked me to replace a Christmas gift he broke out of anger?", "timestamp": 1754503135.3730133}, {"id": "hadrc7", "title": "AITA for telling my niece to stay in the closet until she gets her inheritance?", "timestamp": 1754503183.2604618}, {"id": "1fp7j94", "title": "AITA for making my husband get our 3 year old to sleep because he was the one that promised she can stay up late", "timestamp": 1754503306.6684492}, {"id": "1cy0b6r", "title": "AITA for asking my son and DIL to not use the name of my dead daughter", "timestamp": 1754503631.885661}, {"id": "dgfkt3", "title": "AITA for not telling my Dad he isn't getting the inheritance he's expecting?", "timestamp": 1754503702.6808841}, {"id": "1e1r93o", "title": "AITA for refusing to waive my alimony because my ex husband has cancer and can’t afford it? ", "timestamp": 1754504395.404352}, {"id": "wdp094", "title": "My girlfriend lost her entire college fund for this semester to a scam.", "timestamp": 1754551601.0463183}, {"id": "ed9s25", "title": "One of my uncles told me he's counting down to my 18th birthday and showed me the calendar on his phone. I just turned 16", "timestamp": 1754551730.0141146}, {"id": "ux8uc8", "title": "I met a man who didn’t know how to read today and it’s change my perspective on life", "timestamp": 1754552504.2095442}, {"id": "iidcmv", "title": "I got laid off from my job today thanks to covid and when I called my mom for moral support she told me my stepdad has been secretly paying off my student loans.", "timestamp": 1754552570.7369764}, {"id": "s8oq4e", "title": "I just found out that my husband has been texting a 16 year old girl.", "timestamp": 1754552616.7418404}, {"id": "1hld7pf", "title": "My Family Has a Christmas Tradition I Wish I Never Questioned", "timestamp": 1754553080.1994305}, {"id": "8o44ol", "title": "REST IN POWER u/TheBigSp00k", "timestamp": 1754553155.49827}]}